app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
      @admin_categories = Category.all

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "New Cat"], ["description", "what"], ["created_at", "2025-01-13 14:54:20.446863"], ["updated_at", "2025-01-13 14:54:20.446863"]]
---
    def create
      @admin_category = Category.new(admin_category_params)

      respond_to do |format|
        if @admin_category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Category 1 UPDATED"], ["updated_at", "2025-01-13 14:48:01.700216"], ["id", 1]]
---
    def update
      respond_to do |format|
        if @admin_category.update(admin_category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 11]]
---
    def destroy
      @admin_category.destroy

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_admin_category
      @admin_category = Category.find(params[:id])