app/controllers/admin/orders_controller.rb

    def index
      # This lets us split up the orders by fullfilment then has it so the oldest ones appear at the top
      @not_fullfilled_orders = Order.where(fullfilled: false).order(created_at: :asc)
---
SELECT "orders".* FROM "orders" WHERE "orders"."fullfilled" = ? ORDER BY "orders"."created_at" ASC  [["fullfilled", 0]]

    def create
      @admin_order = Order.new(admin_order_params)

      respond_to do |format|
        if @admin_order.save
---
INSERT INTO "orders" ("customer_email", "fullfilled", "total", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
      respond_to do |format|
        if @admin_order.update(admin_order_params)
---
UPDATE "orders" SET "fullfilled" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["fullfilled", 0], ["updated_at", "2025-01-23 20:39:07.229706"], ["id", 1]]

    def set_admin_order
      @admin_order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]