app/controllers/admin/products_controller.rb

    def index
      @admin_products = Product.all
---
SELECT "products".* FROM "products"

    def create
      @admin_product = Product.new(admin_product_params)


      respond_to do |format|
        if @admin_product.save
---
INSERT INTO "products" ("name", "description", "price", "category_id", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
      # Updates the product but does not delete any uploaded images ensuring the admin doesnt have to reupload images everytime the product is edited
      @admin_product = Product.find(params[:id])
      if @admin_product.update(admin_product_params.reject { |k| k['images'] })
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "products" SET "category_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category_id", 3], ["updated_at", "2025-02-06 19:05:57.941591"], ["id", 8]]

    def destroy
      @admin_product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 7]]

    def set_admin_product
      @admin_product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]