app/controllers/admin/stocks_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def new
      @product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
      @product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def create
      @product = Product.find(params[:product_id])