app/views/admin/orders/_order.html.erb

SELECT "orders".* FROM "orders"
SELECT 1 AS one FROM "orders" LIMIT ?  [["LIMIT", 1]]
SELECT 1 AS one FROM "order_products" WHERE "order_products"."order_id" = ? LIMIT ?  [["order_id", 1], ["LIMIT", 1]]
---

  <% if order.order_products.any? %>