app/views/admin/products/_form.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.order(:name), :id, :name, id: "category", class: ["block shadow rounded-md border outline-none px-3 py-2 mt-2 w-full", {"border-gray-400 focus:outline-blue-600": admin_product.errors[:category_id].none?, "border-red-400 focus:outline-red-600": admin_product.errors[:category_id].any?}] %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC