app/controllers/admin_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."fullfilled" = ? ORDER BY "orders"."created_at" DESC LIMIT ?  [["fullfilled", 0], ["LIMIT", 5]]
SELECT AVG("order_products"."quantity") FROM "order_products" INNER JOIN "orders" ON "orders"."id" = "order_products"."order_id" WHERE "orders"."created_at" BETWEEN ? AND ?  [["created_at", "2025-01-26 00:00:00"], ["created_at", "2025-01-26 18:40:12.265067"]]
SELECT "orders".* FROM "orders" WHERE (created_at > '2025-01-19 18:40:12.279811') ORDER BY "orders"."created_at" ASC
SELECT AVG("orders"."total") FROM "orders" WHERE "orders"."created_at" BETWEEN ? AND ?  [["created_at", "2025-01-26 00:00:00"], ["created_at", "2025-01-26 18:40:12.262305"]]
---
    def index
        #Stored the 5 most recent orders that are not fulfilled
        @orders = Order.where(fullfilled: false).order(created_at: :desc).take(5)
        #Stats with the total number of orders, revenue, average cost of each sale all within the last day
        @quick_stats = {
            sales: Order.where(created_at: Time.now.midnight..Time.now).count,
            revenue: Order.where(created_at: Time.now.midnight..Time.now).sum(:total).round(),
            avg_sale: Order.where(created_at: Time.now.midnight..Time.now).average(:total),
            per_sale: OrderProduct.joins(:order).where(orders: { created_at: Time.now.midnight..Time.now }).average(:quantity)
        }
        #all orders made in the last 7 days in order of creation
        @orders_by_day = Order.where('created_at > ?', Time.now - 7.days).order(:created_at)
        @orders_by_day = @orders_by_day.group_by { |order| order.created_at.to_date}
        @revenue_by_day = @orders_by_day.map { |day, orders| [day.strftime("%A"), orders.sum(&:total)] }