app/controllers/categories_controller.rb

    def show
        @category = Category.find(params[:id])
        @products = @category.products
        if params[:max].present?
            @products = @products.where("price <= ?", params[:max])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? AND (price <= '100') AND (price >= '1')  [["category_id", 2]]