app/controllers/checkouts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def create
    stripe_secret_key = Rails.application.credentials[:stripe_secret_key]
    Stripe.api_key = stripe_secret_key
    cart = params[:cart]
    line_items = cart.map do |item|
      product = Product.find(item['id'])