app/controllers/home_controller.rb

  def index
    @main_categories = Category.take(4)
---
SELECT "categories".* FROM "categories" LIMIT ?  [["LIMIT", 4]]